# pandas
- used for data analysis
- 1.Series - single coulmn and multiple rows
- 2.Dataframe - multiple coulmn and mutiple rows
- we can give our own labels (indexes)

In [2]:
import pandas as pd

In [5]:
a=pd.Series([10,20,30,40])
a

0    10
1    20
2    30
3    40
dtype: int64

In [12]:
b=pd.Series([10,20,30,40],index=['a','b','c','d'])
b

a    10
b    20
c    30
d    40
dtype: int64

## using pandas we are creating 2D arrays by DataFrames
- in DataFrame we can also change the index values

In [19]:
a=pd.DataFrame(
[{
    "nag":100,
    "sonu":100,
    "prav":100,
}],index=['marks'])
a

       nag  sonu  prav
marks  100   100   100

In [21]:
a['nag']

marks    100
Name: nag, dtype: int64

In [1]:
x={
    "sonu":100,
    "nag":200,
    "prav":300,
    
}

In [6]:
pd.Series(x)

sonu    100
nag     200
prav    300
dtype: int64

In [54]:
employee=pd.read_csv("employee data.csv")

In [41]:
employee

      Name   Age   Salary
0       nag    20  100000
1      sonu    20  100000
2      john    19   80000
3    cherry    20   90000
4    chitti    19   85000
5    prabha    20   50000
6    ramesh    19   95067
7     srinu    20   70505
8   praveen    19   59777
9    manasa    19   60607
10   ravali    20   67670
11   swarna    19   68798
12  lavanya    19   60797
13     raji    19   69687

In [9]:
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     14 non-null     object
 1   Age      14 non-null     int64
 2   Salary   14 non-null     int64
dtypes: int64(2), object(1)
memory usage: 464.0+ bytes

In [10]:
employee.head(7)

    Name   Age   Salary
0     nag    20   100000
1    sonu    20   100000
2    john    19    80000
3  cherry    20    90000
4  chitti    19    85000
5  prabha    20    50000
6  ramesh    19    95067

In [11]:
employee.tail(10)

      Name   Age   Salary
4    chitti    19    85000
5    prabha    20    50000
6    ramesh    19    95067
7     srinu    20    70505
8   praveen    19    59777
9    manasa    19    60607
10   ravali    20    67670
11   swarna    19    68798
12  lavanya    19    60797
13     raji    19    69687

In [12]:
type(employee)

pandas.core.frame.DataFrame

In [13]:
employee.tail()

      Name   Age   Salary
9    manasa    19    60607
10   ravali    20    67670
11   swarna    19    68798
12  lavanya    19    60797
13     raji    19    69687

In [14]:
employee.head()

    Name   Age   Salary
0     nag    20   100000
1    sonu    20   100000
2    john    19    80000
3  cherry    20    90000
4  chitti    19    85000

In [21]:
employee.columns

Index(['Name ', 'Age ', 'Salary '], dtype='object')

In [45]:
employee['Salary']

0     100000
1     100000
2      80000
3      90000
4      85000
5      50000
6      95067
7      70505
8      59777
9      60607
10     67670
11     68798
12     60797
13     69687
Name: Salary, dtype: int64

In [46]:
employee['Salary'].mean()

75564.85714285714

In [47]:
employee['Salary'].sum()

1057908

In [48]:
employee[employee['Salary']==employee['Salary'].max()]

  Name   Age   Salary
0   nag    20  100000
1  sonu    20  100000

In [49]:
employee[employee['Salary']==employee['Salary'].min()]

    Name   Age   Salary
5  prabha    20   50000

In [50]:
employee[employee['Salary']==employee['Salary']]

      Name   Age   Salary
0       nag    20  100000
1      sonu    20  100000
2      john    19   80000
3    cherry    20   90000
4    chitti    19   85000
5    prabha    20   50000
6    ramesh    19   95067
7     srinu    20   70505
8   praveen    19   59777
9    manasa    19   60607
10   ravali    20   67670
11   swarna    19   68798
12  lavanya    19   60797
13     raji    19   69687

In [55]:
employee[employee['Salary']>=60000]["Name"]

0         nag
1        sonu
2        john
3      cherry
4      chitti
6      ramesh
7       srinu
9      manasa
10     ravali
11     swarna
12    lavanya
13       raji
Name: Name, dtype: object

In [57]:
employee['Salary']>=60000

0      True
1      True
2      True
3      True
4      True
5     False
6      True
7      True
8     False
9      True
10     True
11     True
12     True
13     True
Name: Salary, dtype: bool

In [58]:
employee[employee['Salary']>=60000]

       Name  Age  Salary
0       nag   20  100000
1      sonu   20  100000
2      john   19   80000
3    cherry   20   90000
4    chitti   19   85000
6    ramesh   19   95067
7     srinu   20   70505
9    manasa   19   60607
10   ravali   20   67670
11   swarna   19   68798
12  lavanya   19   60797
13     raji   19   69687

In [59]:
employee[employee['Salary']<=50000]

     Name  Age  Salary
5  prabha   20   50000

In [60]:
employee['Salary']<=50000

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
Name: Salary, dtype: bool

In [63]:
employee['Name'].describe(include='o')

count         14
unique        14
top       ramesh
freq           1
Name: Name, dtype: object

In [64]:
employee.describe()

             Age         Salary
count  14.000000      14.000000
mean   19.428571   75564.857143
std     0.513553   16182.772615
min    19.000000   50000.000000
25%    19.000000   62515.250000
50%    19.000000   70096.000000
75%    20.000000   88750.000000
max    20.000000  100000.000000